





/*

src
  app
  components
  constants
  containers
  lib
  types


  



my-nextjs-project/
├── public/                              |-->   يحتوي على الملفات الثابتة التي يمكن الوصول إليها مباشرة مثل الصور والخطوط
│   ├── images/                          |-->   مجلد للصور
│   ├── fonts/                           |-->   مجلد للخطوط
│   └── ...                              |-->   أي ملفات ثابتة أخرى (مثل ملفات الـfavicon)
├── src/                                 |-->   يحتوي على كل الكود المصدر للمشروع
│   ├── app/                             |-->   يحتوي على صفحات Next.ts
│   │   ├── favicon.ico                  |-->   الأيكونة الرئيسية
│   │   ├── globals.css                  |-->   ملف CSS للأنماط العالمية
│   │   ├── layout.tsx                   |-->   مكونات تتعلق بتخطيط الصفحة (مثل الهيدر والفوتر)
│   │   ├── page.tsx                     |-->   الصفحة الرئيسية
│   │   └── ...                          |-->   أي صفحات أخرى
│   ├── components/                      |-->   يحتوي على مكونات React
│   │   ├── common/                      |-->   مكونات مشتركة بين أجزاء متعددة من التطبيق
│   │   ├── layout/                      |-->   مكونات تتعلق بتخطيط الصفحة (مثل الهيدر والفوتر)
│   │   └── ...                          |-->   أي مجموعات مكونات أخرى
│   ├── hooks/                           |-->   يحتوي على Hooks مخصصة
│   ├── styles/                          |-->   يحتوي على ملفات CSS أو SASS
│   │   ├── globals.css                  |-->   ملف CSS للأنماط العالمية
│   │   └── ...                          |-->   أي ملفات CSS أخرى
│   ├── utils/                           |-->   يحتوي على وظائف مساعدة
│   ├── context/                         |-->   يحتوي على مكونات React Context
│   ├── services/                        |-->   يحتوي على خدمات مثل API handlers
│   ├── config/                          |-->   يحتوي على ملفات إعدادات المشروع
│   └── ...                              |-->   أي مجلدات أو ملفات أخرى خاصة بالمشروع
├── .env.local                           |-->   ملفات البيئة المحلية
├── .gitignore                           |-->   تحديد الملفات والمجلدات التي لا يجب تتبعها في Git
├── next.config.ts                       |-->   إعدادات تخصيص Next.ts
├── package.json                         |-->   معلومات عن المشروع وdependencies
├── README.md                            |-->   توثيق المشروع
└── ...                                  |-->   أي ملفات إعدادات أخرى



*/